Repository: MarionLegrandLogrami/stacomiR
Catalog: R/po/R-stacomiR_*.po
Languages: fr_fr

source: Writing monthly summary in the database
fr_fr: Ecriture du bilan mensuel dans la base

source: The length of color must be 11
fr_fr: La longueur de color doit être 1

source: Migration graph %s, %s, %s, %s
fr_fr: Graph migration %s, %s, %s, %s

source: Number of glass eels (x1000)
fr_fr: Effectif de civelles (x1000)

source: Sum of numbers =%s
fr_fr: Somme des effectifs = %s

source: measured
fr_fr: mesurés

source: calculated
fr_fr: calculé

source: direct
fr_fr: ponctuel

source: average trapping time = %s days
fr_fr: durée moyenne du piégeage = %s jours

source: maximum term = %s
fr_fr: duree max= %s

source: minimum term = %s
fr_fr: durée min= %s

source: Fishway
fr_fr: DF

source: Unknown working
fr_fr: Fonctionnement inconnu

source: Unknow operation type
fr_fr: Type de fonctionnement inconnu

source: stop
fr_fr: arrêt

source: CD
fr_fr: DC

source: working
fr_fr: Fonct.

source: stopped
fr_fr: Arrêté

source: Month
fr_fr: Mois

source: Number (x1000)
fr_fr: Effectif (x1000)

source: Glass eels graph %s
fr_fr: Graph civelles %s

source: Glass eels graph %s, %s, %s, %s
fr_fr: Graph civelles %s, %s, %s, %s

source: weighted
fr_fr: pesé

source: counted
fr_fr: compté

source: number of operations =%s
fr_fr: nombre d'opérations = %s

source: average trapping time = %sdays
fr_fr: durée moyenne du piégeage = %s jours

source: maximum term = %sdays
fr_fr: duree max= %s jours

source: minimum term = %sdays
fr_fr: durée min= %s jours

source: Calculation of the monthly balance sheet
fr_fr: calcul des bilans mensuels

source: writing of %s
fr_fr: ecriture de %s

source: The year of beginning has been chosen
fr_fr: L'année de début a été choisie

source: First year
fr_fr: Première année

source: The last year has been chosen
fr_fr: La dernière année a été choisie

source: Last year
fr_fr: Dernière année

source: Migration of all the years in the same graphic
fr_fr: Migration de toutes les annees dans le meme graphique

source: Exit
fr_fr: Quitter

source: Loading of the list for fishways and choice of the time step
fr_fr: Chargement des listes df et choix pas de temps

source: Start
fr_fr: Début

source: Beginning date has been chosen
fr_fr: La date de debut a ete choisie

source: End
fr_fr: Fin

source: Ending date has been chosen
fr_fr: La date de fin a ete choisie

source: Monthly graph
fr_fr: Graphe mensuel

source: Another monthly graph
fr_fr: Autre graphe mensuel

source: Boxplot
fr_fr: Diagramme en boites

source: table
fr_fr: tableau

source: Table
fr_fr: Tableau

source: start
fr_fr: début

source: The beginning date has been chosen
fr_fr: La date de début a été choisie

source: The ending date has been chosen
fr_fr: La date de fin a ete choisie

source: Calendar
fr_fr: Calendrier

source: Loading of the monitoring stations
fr_fr: Chargement des stations de mesure

source: Begginning
fr_fr: Démarrage

source: Summary graphic
fr_fr: Graphe bilan

source: all
fr_fr: tous

source: choice of number in sample (one, several, both)
fr_fr: choix de l'effectif de l'échantillon (un, plusieurs, tous)

source: Mean weight report
fr_fr: Bilan des poids moyens

source: Beginning year
fr_fr: Année de début

source: Ending year
fr_fr: Année de fin

source: load
fr_fr: charger

source: exit
fr_fr: quitter

source: plot.type='1', plot of mean weight of glass eel against the mean date of operation
fr_fr: plot.type='1', graphique des poids moyen par rapport à la date moyenne de l'opération

source: plot.type=2, standard plot of current coefficent
fr_fr: plot.type=2, graphique standard avec coefficient actuels en base

source: Leng
fr_fr: Tail

source: plot.type=3, same as 1 but size of the bubble according to number
fr_fr: plot.type=3, pareil que 1 mais la taille de la bulle dépend de l'effectif de l'échantillon

source: seasonal
fr_fr: saisonnier

source: model.type='seasonal', sine wave curve for a cyclic variation fitted with nls
fr_fr: model.type='seasonal', courbe sinusoïde pour une variation cyclique, calibration non linéaire par nls

source: model.type='seasonal1', long term variation along with seasonal variation fitted with gam
fr_fr: model.type='seasonal1', variation de long terme et variation saisonnière calée par des gam

source: model.type='seasonal2', long term variation + seasonal component fitted with sine curve
fr_fr: model.type='seasonal2', variation de long terme + variation saisonnière ajustée à l'aide d'une sinusoïde

source: export
fr_fr: exporter

source: Loading of the lists for taxa, stages and counting devices
fr_fr: Chargement des listes taxons et stades et dc

source: calculate
fr_fr: calculer

source: Calculation of numbers by time step
fr_fr: Calcul des effectifs par pas de temps

source: graph
fr_fr: graphique

source: Balance graphic
fr_fr: Graphe bilan

source: grcum
fr_fr: graphique cumulé

source: Cumulative graphic
fr_fr: Graphe cumul

source: Balance sheet in .csv
fr_fr: Tables bilan en .csv

source: write
fr_fr: écrire

source: Writing daily summary in the database
fr_fr: Ecriture du bilan journalier dans la base

source: quit
fr_fr: quitte

source: Loading of the lists for taxa, stages, counting devices, qualitative and quantitative parameters
fr_fr: Chargement des listes taxons, stades, dc, paramètres qualitatifs et quantitatifs

source: with
fr_fr: avec

source: without
fr_fr: sans

source: Choice of batch type, inclusion of samples ?
fr_fr: Choix du type de lot, inclusion des echantillons ?

source: from
fr_fr: de

source: to
fr_fr: a

source: calculation
fr_fr: calcul

source: Plot for qualitative parm
fr_fr: graphique pour paramètre qualitatif

source: plot for quantitative parm
fr_fr: graphique pour paramètre quantitatif

source: Crossed graph for qualitative and quantitative parameter
fr_fr: Graphique croisé pour paramètres qualitatifs et quantitatifs

source: Summary
fr_fr: Bilan

source: Calculation of environnemental conditions by time step
fr_fr: calcul des condition environnementales par pas de temps

source: Loading of the existing daily summaries
fr_fr: Chargement des bilans journaliers existants

source: Migration of all the years in the same graphic, cumulated
fr_fr: Migration de toutes les années dans le même graphique, cumulé

source: cumulated migrations %
fr_fr: cumul migratoire en %

source: day
fr_fr: jour

source: Daily migration
fr_fr: Migration journalière

source: week
fr_fr: semaine

source: weekly migration
fr_fr: migration hebdomadaire

source: fortnight
fr_fr: quin

source: Fortnight Migration
fr_fr: Migration par quinzaine

source: month
fr_fr: mois

source: Monthly migration
fr_fr: Migration par mois

source: Fortnight migration
fr_fr: Migration par quinzaine

source: gr(all)
fr_fr: gr(tous)

source: Loading of the view vue_ope_lot, and choice of the counting device and of the time steps
fr_fr: chargement de la vue (vue_ope_lot) et choix du dc et des pas de temps

source: Batch summary
fr_fr: Bilan groupé

source: Fist timestamp
fr_fr: horodate de debut

source: Last timestamp
fr_fr: Dernière horodate

source: dotplot
fr_fr: nuage de points

source: density
fr_fr: densité

source: Loading view vue_ope_lot, and choice of counting device and time steps
fr_fr: chargement de la vue (vue_ope_lot) et choix du dc et des pas de temps

source: Silver eel summary
fr_fr: Bilan anguilles argentées

source: First date
fr_fr: Début

source: Last date
fr_fr: Fin

source: summary
fr_fr: bilan

source: Summary of encountered species for the counting device
fr_fr: Bilan des espèces présentes sur le DC

source: Choice of cutting
fr_fr: Choix du decoupage

source: Species summary
fr_fr: Bilan espèces

source: Loading
fr_fr: Chargement

source: Pie chart graphic
fr_fr: Graphe en camembert

source: Summary tables in .csv and XML
fr_fr: Tables bilan en .csv et XML

source: valeurchoisie should be a vector of length 1
fr_fr: valeurchoisie doit être de longueur 1

source: The selected valeur,
fr_fr: La valeur sélectionnée,

source: not in the list of possible values :
fr_fr: n'est pas dans la liste des valeurs possibles :

source: choice made
fr_fr: choix effectué

source: %s rows deleted from table tj_coefficientconversion_coe
fr_fr: %s lignes supprimées depuis la table tj_coefficientconversion_coe

source: Counting device selected
fr_fr: Le DC a été sélectionné

source: Select taxa for this counting device (for all periods)
fr_fr: Sélection des taxons du DC (pour l'instant sur toutes les périodes)

source: Counting devices data
fr_fr: Données sur les dispositifs de comptage

source: close
fr_fr: fermer

source: Counting devices choice
fr_fr: Choix des dispositifs de Comptage

source: Error : no counting device in the database (the query returns 0 entry)
fr_fr: Erreur : Aucun DC n'est rentre dans la base (aucune ligne de retour de la requete)

source: Counting device not selected
fr_fr: DC non sélectionné

source: drop here
fr_fr: déposer ici

source: NA values dc
fr_fr: Valeurs NULL dc

source: Fishway selected
fr_fr: DF sélectionné

source: Fishways data
fr_fr: Données des DF

source: Fishway choice
fr_fr: Choix du DF

source: No fishway in the database (the query returns 0 entry)
fr_fr: Aucun DF n'est rentre dans la base (aucune ligne de retour de la requête)

source: NA values df
fr_fr: Valeurs NULL df

source: Monitoring stations selection
fr_fr: Choix des stations de mesure

source: Select at least one value
fr_fr: Sélectionnez au moins une valeur

source: The monitoring stations have been selected
fr_fr: Les stations de mesure ont été sélectionnées

source: Stop : no data for selected monitoring station (problem with the ODBC link ?)
fr_fr: Stop il n'y a aucune donnée de station de mesure (pb lien ODBC ?)

source: the stationmesure should be of class character
fr_fr: stationmesure doit être une chaine de caractères

source: NA values for stationmesure
fr_fr: Il y a des valeurs NA pour stationmesure

source: stationmesure code not present : %s
fr_fr: stationmesure code non présent: %s

source: horodate should be a vector of length 1
fr_fr: l'horodate doit être de longueur 1

source: horodate should not be null
fr_fr: l'horodate ne doit pas être NULL

source: Formatting problem, the character vector you are trying to pass as horodate could not be parsed. Check example or documentation
fr_fr: Problème de formatage, le vecteur de caractères que vous essayez de passer en horodate n'a pas pu être converti. Vérifier un exemple ou la documentation

source: Formatting problem, the character vector you are trying to pass as horodate could not be parsed. Check example or documentation
fr_fr: Problème de formatage, le vecteur de caractères que vous essayez de passer en horodate n'a pas été converti. Vérifier un exemple ou la documentation

source: Horodate selected
fr_fr: Horodate sélectionnée

source: Loading parameters query completed
fr_fr: La requête est effectuée pour charger les paramètres

source: No data for selected device, taxa and stage
fr_fr: Pas de données les dispositifs, taxons et stades sélectionnés

source: Feature has been selected
fr_fr: La caractéristique a été sélectionnée

source: Internal error : unable to load any feature to make the choice
fr_fr: Erreur interne : impossible de charger une caractéristique à choisir

source: NA values par
fr_fr: Valeurs NULL par

source: Internal error : tried to set a value for par_selected without initializing the data slot
fr_fr: Erreur interne : il faut initialiser le slot data avant de fixer une valeur pour par_selectionne

source: No data for par %s
fr_fr: Pas de données pour par %s

source: Sample characteristic
fr_fr: Caractéristiques du lot

source: Parameter selected
fr_fr: Paramètre sélectionné

source: Select here
fr_fr: sélectionnez ici

source: Error : no parameters in the database (the query returns 0 entry)
fr_fr: Erreur : Aucun paramètres n'est rentré dans la base (aucune ligne de retour de la requête)

source: Choice of a sample characteristic
fr_fr: Choix d'une caractéristique de lot

source: Features have been selected
fr_fr: Les caractéristiques ont été sélectionnées

source: Qualitative
fr_fr: Caractéristique qualitative

source: No Parameter selected
fr_fr: Pas de paramètre choisi

source: Error : no qualitative parameters in the database (the query returns 0 entry)
fr_fr: Erreur : Aucun parametre qualitatif dans la base de donnees n'est rentre dans la base (aucune ligne de retour de la requete)

source: No data for this counting device and this taxa
fr_fr: Pas de données pour ce DC, et ce taxon

source: Stage selected
fr_fr: Le stade a été sélectionné

source: Qualitative feature
fr_fr: Caractéristique qualitative

source: Quantitative feature
fr_fr: Caractéristique quantitative

source: Stage selection
fr_fr: Choix du Stade

source: Stop internal error : load data to make a choice
fr_fr: Stop erreur interne : charger les données pour faire le choix

source: No Stage selected
fr_fr: Pas de stade sélectionné

source: Error : no stages in the database (the query returns 0 entry)
fr_fr: Erreur : pas de stade dans la base (la requête renvoit 0 lignes)

source: No value for argument stage
fr_fr: Pas de valeur pour l'argument stades

source: No data for this counting device and this taxa %s
fr_fr: Pas de données pour ce dispositif de comptage et ce taxon %s

source: Stop there is no line in the taxa table (problem with the ODBC link ?)
fr_fr: Stop il n'y a aucune ligne dans la table des taxons (pb lien ODBC ?)

source: Taxon selected
fr_fr: Le taxon a été sélectionné

source: Taxon selection
fr_fr: Choix du Taxon

source: Taxa selected
fr_fr: Taxon sélectionné

source: No taxa selected
fr_fr: Le stade a été sélectionné

source: No value for argument taxa
fr_fr: Pas de valeur pour l'argument taxon

source: Taxa not present : %s
fr_fr: Taxons non présents : %s

source: Time steps choice
fr_fr: Choix des Pas de Temps

source: Starting date
fr_fr: Date de début

source: Number of time step choice
fr_fr: Choix du nombre de pas de temps

source: End date
fr_fr: Date de fin

source: Internal error : no entry in time steps table
fr_fr: Erreur interne : le tableau des pas de temps ne contient aucune ligne

source: Timesteps loaded
fr_fr: Les pas de temps ont été chargés

source: Number of time steps choice
fr_fr: Choix du nombre de pas de temps

source: Ending date
fr_fr: Date de fin

source: Time step duration should be daily
fr_fr: la durée du pas devrait être journalière

source: Time step can't include more than one year
fr_fr: le pas de temps ne doit pas être a cheval sur plusieurs années

source: Time steps loaded
fr_fr: Les pas de temps ont été chargés

source: Time steps choice (1 year duration)
fr_fr: Choix des Pas de Temps (duree 1 an)

source: Start date
fr_fr: Date de debut

source: Time step
fr_fr: Pas de temps

source: Number of days
fr_fr: Nb jour

source: internal error length(Lesref_timestep$Labelref_timestep) == 0
fr_fr: erreur interne length(Lesref_timestep$Labelref_timestep) == 0

source: datedebut not parsed to datetime try format like '01/01/2017'
fr_fr: datedebut non convertie en datetime, essayer un format comme '01/01/2017'

source: datefin not parsed to datetime try format like '01/01/2017'
fr_fr: datedebut non convertie en datetime, essayer un format comme '01/01/2017'

source: Not implemented for objectreport = %s
fr_fr: Non éxécuté pour objectBilan = %s

source: Year selected
fr_fr: Année choisie

source: Year choice
fr_fr: Choix de l'année

source: Problem when loading data or no data in the database (ODBC link ?)
fr_fr: Problème lors du chargement des données ou pas de données dans la base (lien ODBC ?)

source: no year
fr_fr: pas d'année

source: Attention, year
fr_fr: Attention, année

source: is not available in the database, available years :
fr_fr: n'est pas disponible dans la base de données, données disponible :

source: You need to choose a counting device, clic on validate
fr_fr: Vous devez choisir un dispositif de comptage, cliquez sur valider

source: You need to choose a taxa, clic on validate
fr_fr: Vous devez choisir un taxon, cliquez sur valider

source: You need to choose a stage, clic on validate
fr_fr: Vous devez choisir un stade de développement, cliquez sur valider

source: You need to choose the starting year
fr_fr: Il faut choisir l'annee de debut

source: You need to choose the ending year
fr_fr: Il faut choisir l'annee de fin

source: The object report_annual is stored in the stacomi environment, type r_ann <-get('report_annual',envir_stacomi)
fr_fr: L'objet BilanAnnuels est stocké dans l'environnement stacomi, tapez r_ann<-get('report_annual',envir_stacomi)

source: dc_name argument should have length
fr_fr: l'argument dc_name doit avoir une longueur

source: tax_name argument should have length
fr_fr: l'argument tax_name doit avoir une longueur

source: std_name argument should have length
fr_fr: l'argument std_name doit avoir une longueur

source: No data
fr_fr: Pas de données

source: Writing the graphical object into envir_stacomi environment : write g=get('g',envir_stacomi)
fr_fr: Ecriture du graphique dans l'environnement envir_stacomi: écrire g=get('g',envir_stacomi)

source: Time steps loaded fot this counting device
fr_fr: Les pas de temps ont été chargés pour ce DC

source: You need to choose the starting date
fr_fr: Vous devez choisir une date de début

source: You need to choose the ending date
fr_fr: Vous devez choisir une date de fin

source: plot.type must be 1,2,3 or 4
fr_fr: plot.type doit être 1,2,3 ou 4

source: No data for this counting device
fr_fr: Il n'y a pas de données sur ce DC

source: time in hours
fr_fr: temps en heures

source: Working of the counting device
fr_fr: Fonctionnement du dispositif de comptage

source: Operation of the counting device %s
fr_fr: Opération du dispositif de comptage %s

source: duration
fr_fr: durée

source: operation
fr_fr: opération

source: Writing the table into envir_stacomi environment : write periodeDC=get('periodeDC',envir_stacomi)
fr_fr: Ecriture du tableau dans l'environnement envir_stacomi : écrire periodeDC=get('periodeDC',envir_stacomi)

source: Counting device
fr_fr: Dispositif de franchissement

source: Func.
fr_fr: Fonct.

source: Stop
fr_fr: Arrêt

source: Normal func.
fr_fr: Fonct. normal

source: Normal oper.
fr_fr: Fonct. normal

source: Operational stop
fr_fr: Arrêt de fonctionnement

source: Dysfunct.
fr_fr: Dysfonct.

source: Unknown
fr_fr: Inconnu

source: Operation of the counting device
fr_fr: Opération du dispositif de comptage

source: Shutdowns types for this counting device
fr_fr: Types d'arrêts du DC

source: No Shutdowns types for this pass
fr_fr: Pas de données pour ce DF

source: Writing of %s
fr_fr: Ecriture de %s

source: Writing of %s this might take a while, please be patient ...
fr_fr: Ecriture de %s ceci peut être long, de grace soyez patient...

source: summary statistics for CD=%s
fr_fr: statistiques du bilan pour DC=%s

source: Duration in days (operation type):
fr_fr: Durée en jours (types de fonctionnement):

source: Duration in days (operation):
fr_fr: Durée en jours (fonctionnement):

source: Time steps of the fishway loaded
fr_fr: Les pas de temps de ce DF ont été chargés

source: You need to choose a crossing device, clic on validate
fr_fr: Il faut choisir un dispositif de franchissement, cliquez sur valider

source: No data for this fishway
fr_fr: Pas de données pour ce DF

source: computing ...
fr_fr: calcul...

source: Progress %
fr_fr: Progression %

source: Fishway operation %s
fr_fr: Fonctionnement des DF %s

source: Writing the table into envir_stacomi environment : write periodeDF=get('periodeDF',envir_stacomi)
fr_fr: Ecriture de tableau dans l'environnement envir_stacomi : écrire periodeDF=get('periodeDF',envir_stacomi)

source: Fishway operation
fr_fr: Fonctionnement des DC

source: Shutdowns types for this fishway
fr_fr: Types d'arrêts du DF

source: summary statistics for DF=%s
fr_fr: statistiques du bilan pour DF=%s

source: Environmental conditions loading query completed
fr_fr: La requête est effectuée pour charger les conditions environnementales

source: You need to choose a monitoring station, clic on validate
fr_fr: Il faut choisir une station de mesure puis cliquer sur valider

source: Some monitoring stations lack associated values (no environmental data)
fr_fr: Certaines stations de mesure n'ont pas de valeur associée (pas de données environnementales)

source: No environmental conditions values for selected monitoring stations (report_env.R)
fr_fr: Aucune valeur de conditions environnementales pour les stations de mesure sélectionnées (report_env.R)

source: The query to load the coefficients of conversion is finished
fr_fr: La requete est effectuee pour charger les coefficients de conversion

source: %1.0f lines found for the conversion coefficients
fr_fr: %1.0f lignes trouvées pour le coefficient de conversion

source: You need to choose a size class
fr_fr: Il faut choisir une classe de taille

source: selectedvalue must be of length one
fr_fr: selectedvalue doit être de longueur 1

source: choice of number in sample (one, several,all)
fr_fr: choix de la catégorie d'effectif (un, plusieurs, tous)

source: To obtain the table, type : report_ge_weight=get('report_ge_weight',envir_stacomi)@data
fr_fr: Pour récupérer le tableau, taper :eport_ge_weight=get('report_ge_weight',envir_stacomi)@data

source: size is missing, lots %s
fr_fr: effectif non renseigne, lots %s

source: ggplot object p assigned to envir_stacomi
fr_fr: l'object ggplot p est enregistré dans envir_stacomi

source: Internal error, the value has not been selected before launching plot
fr_fr: Erreur interne, la valeur n'a pas été sélectionnée avant de lancer le graphique

source: wet weights
fr_fr: poids humides

source: dry weights
fr_fr: poids secs

source: wet and dry weights
fr_fr: poids humides et secs

source: mean weights
fr_fr: poids moyens

source: Seasonal trend of %s, from %s to %s
fr_fr: Tendances saisonnières de %s, de %s à %s

source: object p assigned to envir_stacomi
fr_fr: l'object ggplot p est enregistré dans envir_stacomi

source: date should be in colnames(data)
fr_fr: la date devrait être dans colnames(data)

source: date should be POSIXct
fr_fr: la date devrait être POSIXct

source: Model equations assigned to envir_stacomi (result)
fr_fr: Les équations du modèle ont été écrites dans l'objet "result" dans l'environnement envir_stacomi

source: gam model g1 assigned to envir_stacomi
fr_fr: le modèle gam g1 est attribué à envir_stacomi

source: One model per year, doy starts in august
fr_fr: Un modèle par année, doy démarre en août

source: gam model g2 assigned to envir_stacomi
fr_fr: le modèle gam g2 est attribué à envir_stacomi

source: Comparison of the coefficients obtained by \citet{desaunay_seasonal_1997} and in the present modelling of estuarine samples.
fr_fr: Comparaison des coefficients obtenus par \citet{desaunay_seasonal_1997} et dans ce modèle des lots estuariens.

source: summary_harmonic
fr_fr: resumé_cyclique

source: summary coefficients written in %s
fr_fr: les coefficients du bilan ont été écrit dans %s

source: Table for predictions newcoe assigned to envir_stacomi
fr_fr: Le tableau pour les prédictions newcoe est attribué à l'environnement envir_stacomi

source: Table of data don assigned to envir_stacomi
fr_fr: Le tableau des données don est attribué à l'environnement envir_stacomi

source: Table of current coefficients coe assigned to envir_stacomi
fr_fr: Le tableau des prédictions newcoe est attribué à l'environnement envir_stacomi

source: data directory :%s
fr_fr: répertoire d'écriture des données :%s

source: To obtain the table, type : import_coe=get("import_coe",envir_stacomi)
fr_fr: Pour récupérer le tableau, taper : import_coe=get('import_coe',envir_stacomi)

source: Do you want to write data in the database ?
fr_fr: Voulez vous ecrire les donnees dans la base ?

source: Warning!
fr_fr: Attention!
