Repository: MarionLegrandLogrami/stacomiR
Catalog: R/po/R-stacomiR_*.po
Languages: fr_fr

source: Attention, you must fit a model before trying to write the predictions in the database
fr_fr: Attention, vous devez ajuster un modèle avant d'essayer d'écrire les prédictions dans la base de données

source: You need to launch computation first, clic on calc
fr_fr: Il faut d'abord lancer le calcul, cliquer sur calc

source: Attention, no time step selected, compunting with default value
fr_fr: Attention le choix du pas de temps n'a pas été effectué, calcul avec la valeur par défaut

source: Starting migration summary ... be patient
fr_fr: Début du bilan migration... patientez

source: Summary object is stocked into envir_stacomi environment : write report_mig=get('report_mig',envir_stacomi)
fr_fr: L'objet Bilan est stocke dans l'environnement envir_stacomi, écrire report_mig=get('report_mig',envir_stacomi)

source: To access calculated data, type report_mig@calcdata
fr_fr: Pour accéder aux données calculées, écrire : report_mig@calcdata

source: There are no values for the taxa, stage and selected period
fr_fr: Il n'y a pas d'effectif pour le taxon, le stade, et la période sélectionnée

source: Please select DC, taxa, and stages for a complete command
fr_fr: Il faut sélectionner les DC, les taxons et les stades pour avoir une commande complète

source: Statistics about migration :
fr_fr: Statistiques concernant la migration :

source: duplicated values in No.pas
fr_fr: No.pas contient des doublons

source: Cumulative migration
fr_fr: Migration cumulée

source: Cumulative count %s, %s, %s, %s
fr_fr: Effectifs cumulés %s, %s, %s, %s

source: Warning, this function applies for annual summaries
fr_fr: Attention cette fonction est pour les bilans annuels

source: unrecognised plot.type argument, plot.type should either be standard or step
fr_fr: argument plot.type non reconnu, plot.type doit être standard ou step

source: no report written to database : database_expected argument=FALSE
fr_fr: aucun bilan écrit dans la base de données : database_expected argument=FALSE

source: the report_mig should be of class report_mig
fr_fr: le bilan report_mig devrait être de classe report_mig

source: the silent argument should be a logical
fr_fr: l’argument silent doit être booleen

source: Writing daily summary in the database %s
fr_fr: Ecriture du bilan journalier dans la base %s

source: A summary has already been written in the database the :%s Overwrite ?
fr_fr: Un résumé a déjà été écrit dans la base de données le %s : Ecraser ?

source: This report should be for just one taxa
fr_fr: Ce bilan ne devrait être que pour un taxon

source: You need to choose at least one parameter qualitative or quantitative
fr_fr: Il faut choisir au moins une caractéristique quantitative ou qualitative

source: You need to choose at least one quantitative or qualitative attribute
fr_fr: Il faut choisir au moins une caractéristique quantitative ou qualitative

source: par should be a character
fr_fr: pardoit être une chaine de caractères

source: No data for quantitative parameter, perhaps you forgot to run the calcule method
fr_fr: Pas de données pour les caractères quantitatifs, peut-être avez vous oublié de lancer la méthode calcule

source: The parameter %s is not in the selected parameters
fr_fr: Le paramètre %s n'est pas dans les paramètres sélectionnés

source: No data for this parameter, nothing to do
fr_fr: Pas de données pour ce paramètre, rien à faire

source: %s lines have been converted from quantitative to qualitative parameters
fr_fr: %s lignes ont été converties de caractéristique quantitative vers caractéristique qualitative

source: cannot perform calcule method, no data in either qualitative or quantitative parameters
fr_fr: ne peut pas lancer la méthode calcule, aucune données pour les paramètres quantitatifs ou qualitatifs

source: The calculated data are in slot calcdata
fr_fr: Les données calculées sont dans le slot calcdata

source: no data in calcdata, have you forgotten to run calculations ?
fr_fr: pas de données dans calcdata, auriez vous oublié de lancer le calcul ?

source: Number
fr_fr: Effectif

source: Writing the graphical object into envir_stacomi environment : write g=get("g",envir_stacomi)
fr_fr: Ecriture de l'objet graphique dans l'environnement envir_stacomi : écrire g=get('g',envir_stacomi)

source: Quantitative parameter
fr_fr: Caractéristique quantitative

source: No data in slot calcdata, did you forget to run the calcule method ?
fr_fr: Pas de donnée dans le slot calcdata, avez-vous oublié de lancer la méthode calcule

source: Sum
fr_fr: Bilan

source: Summary for dc %s, taxa %s, stage %s.
fr_fr: Summary pour dc %s, taxon %s, stade %s.

source: r_mig_env object is stocked into envir_stacomi environment
fr_fr: L'objet Bilan r_mig_envest stocké dans l'environnement envir_stacomi

source: You don't have any environmental conditions within the time period
fr_fr: Vous n'avez pas de conditions environnementales sur la periode de temps

source: Attention, on one station :%s there are several entries for the same day :%s we will calculate average for numeric and use the first value for qualitative parameter
fr_fr: Attention, sur une station : %s il y a plusieurs entrées pour le même jour : %s. Pour les numériques, utilisation de la moyenne, pour les paramètres qualitatifs utilisation de la première valeur

source: Number, %s, %s
fr_fr: Effectif %s, %s

source: you have %s taxa in the report, those will be aggregated
fr_fr: vous avez %s taxons dans le bilan, ils seront agrégés

source: you have %s stages in the report, those will be aggregated
fr_fr: vous avez %s stades dans le bilan, ils seront agrégés

source: Qualitative parm
fr_fr: Caractéristique qualitative

source: the ggplot object has been assigned to envir_stacomi, type g<-get('g',envir_stacomi)
fr_fr: L'objet graphique est décrit dans envir_stacomi, écrire g<-get('g',envir=envir_stacomi)

source: report_mig_interannual can only take one taxa
fr_fr: la classe report_mig_interannualne peut prendre qu'un taxon

source: report_mig_interannual can only take one stage
fr_fr: la classe report_mig_interannualne peut prendre qu'un stade

source: DC with missing values : %s
fr_fr: DC avec valeurs manquantes : %s

source: Years with no value : %s
fr_fr: Années sans valeur : %s

source: Some years are missing in the t_reportjournalier_bjo table, loading them now !
fr_fr: Certaines années sont manquantes dans le tableau t_bilanjournalier_bjo, leur chargement est en cours !

source: Running report_mig for year %s
fr_fr: Calcul du Bilan Migration pour l'année %s

source: For glass eel it is not possible to check that data are up to date
fr_fr: Pour les civelles il n'est pas possible de vérifier que les données sont à jour

source: Years with values differing between t_reportjournalier_bjo and report_annual : %s
fr_fr: Années avec des valeurs différentes entre t_bilanjournalier_bjo et report_annua: %s

source: Running report_mig to correct data for year %s
fr_fr: Calcul du Bilan Migration pour corriger les données de l'année %s

source: Some data differ between t_reportjournalier_bjo table, this means that they have been changed after the last report_mig was run, do you want to load them again for calculation ?
fr_fr: Certaines années diffèrent entre le tableau t_bilanjournalier_bjo et la base, ceci implique qu'il y a eu des changements dans la base après que le dernier bilan migration ait tourné, voulez vous les recharger pour les intégrer au calcul ?

source: Attention, there is no migration summary for this year
fr_fr: Attention il n'existe pas de bilan migration pour cette année

source: , this taxa and this stage (report_mig_interannual.r)
fr_fr: , ce taxon et ce stade report_mig_interannual.r)

source: Annual migrations query completed
fr_fr: La requête est effectuée pour charger les migrations sur les années

source: Writing report_mig_interannual in the environment envir_stacomi : write r_mig_interannual=get('report_mig_interannual',envir_stacomi)
fr_fr: Ecriture du bilan Migration Interannuelle dans l'environnement envir_stacomi : écrire bmi=get('report_mig_interannual',envir_stacomi)

source: timesplit should be one of :
fr_fr: le pas de temps doit être choisi parmi :

source: 2 weeks
fr_fr: 2 semaines

source: You have more than one station in the report, the dc from the report should belong to the same station
fr_fr: Vous avez plus qu'une station dans le Bilan, le DC du bilan doit appartenir à la même station de contrôle

source: No rows in report_mig_interannual@data, nothing to run calculations on
fr_fr: Pas de lignes dans le tableau report_mig_interannual@data, rien à calculer

source: Attention : you have to complete a migration summary for at least one of the selected year before launching a inter-annual summary
fr_fr: ATTENTION : Veuillez effectuer un Bilan Migration pour au moins une des annees selectionnees avant de lancer un bilan interannuel

source: Migration for years
fr_fr: Migration pour années

source: Historical amplitude
fr_fr: Amplitue historique

source: Interannual mean
fr_fr: Moyenne Interannuelle

source: Writing the graphical object into envir_stacomi environment : write g=get("gi",envir_stacomi) with i=%s
fr_fr: Ecriture de l'objet graphique dans l'environnement envir_stacomi : écrire g=get('gi',envir_stacomi) avec

source: Choose year
fr_fr: Choisir l'année

source: %s %s, Cumulated numbers %s
fr_fr: %s %s, Effectifs cumulés %s

source: Annual migration percentage
fr_fr: Pourcentage de la migration annuelle

source: year
fr_fr: année

source: "Writing the graphical object into envir_stacomi environment : write g=get("gi",envir_stacomi) with i=%s
fr_fr: Ecriture de l'objet graphique dans l'environnement envir_stacomi : écrire g=get('gi',envir_stacomi) avec i =%s

source: Warning : you have to complete a migration summary for at least one of the selected year before launching a inter-annual summary
fr_fr: ATTENTION : Veuillez effectuer un Bilan Migration pour au moins une des années sélectionnées avant de lancer un bilan interannuel

source: Internal error, timesplit
fr_fr: Erreur interne, timesplit

source: not working for seasonal plot
fr_fr: ne marche pas pour graphique saisonnier

source: plot.type argument invalid
fr_fr: argument plot.type non valide

source: Choice made, and object report_mig_mult assigned in envir_stacomi
fr_fr: Choix effectué et objet report_mig_multécrit dans envir_stacomi

source: The summary object is stored in environment envir_stacomi, write report_mig_mult=get("report_mig_mult",envir_stacomi)
fr_fr: L'objet Bilan est stocke dans l'environnement envir_stacomi, écrire report_mig_mult=get("report_mig_mult",envir_stacomi)

source: Raw data are stored in report_mig_mult@data, processed data in report_mig_mult@calcdata\n
fr_fr: Les données brutes sont stockées dans report_mig_mult@data, les résultats sont stockés dans report_mig_mult@calcdata\n

source: DC has length zero, are you connected to the right schema, do you use the right dc number ?
fr_fr: DC à pour longueur zéro, êtes vous connecté au bon schéma, utilisez vous le bon numéro de dc ?

source: Taxa has length zero, are you connected to the right schema, do you use the right taxa ?
fr_fr: Taxon a pour longueur zéro, êtes vous connecté au bon schéma, utilisez vous le bon taxon ?

source: Stage has length zero, are you connected to the right schema, do you use the right stage ?
fr_fr: Stade a pour longueur zéro, êtes vous connecté au bon schéma, utilisez vous le bon stade ?

source: The plot has been assigned to p in envir_stacomi,write p<-get('p',envir_stacomi) to retrieve the object
fr_fr: Le graphique a été écrite (assigned) comme "p" dans l'environnement envir_stacomi, écrire p<-get('p',envir_stacomi) pour récupérer l'objet

source: The data for the plot have been assigned to envir_stacomi,write grdata<-get('grdata',envir_stacomi) to retrieve the object
fr_fr: Les données du graphique ont été écrites dans l'environnement stacomi, pour les récupérer écrire grdata<-get('grdata',envir_stacomi)

source: dc=%s Conversion weight / number
fr_fr: dc=%s Conversion poids effectif

source: Careful sum=0, you didn't enter the coefficient of conversion
fr_fr: Attention somme =0,vous n'avez pas encore rentre les coef de conversion

source: This function must have for argument an object of class report_mig_mult
fr_fr: Cette fonction a comme argument un objet de classe report_mig_mult

source: Loading data for operations
fr_fr: Chargement des données des opérations:

source: Sample characteristics have been loaded from the database
fr_fr: Les caractéristiques du lot ont été chargé depuis la base de données

source: You need to choose a parameter, clic on validate
fr_fr: Vous devez choisir un paramètre, cliquez sur valider

source: No information for these samples during the selected period
fr_fr: Pas d'informations sur ces lots pendant la période sélectionnée

source: To obtain the table, type : report_sample_char=get('report_sample_char',envir_stacomi)
fr_fr: Pour récupérer le tableau, taper : report_sample_char=get('report_sample_char',envir_stacomi)

source: plot.type must be 1,2,3
fr_fr: plot.type doit être 1,2 ou 3

source: To obtain the graphical object, type : g<-get("g",envir_stacomi)
fr_fr: Pour obtenir l'objet graphique, écrire g=get('g',envir_stacomi)

source: To obtain the table, type : report_lot=get('report_lot',envir_stacomi)
fr_fr: Pour récupérer le tableau, taper : report_lot=get('report_lot',envir_stacomi)

source: Data loaded
fr_fr: Les données ont été chargées

source: you need to choose a value for limit1hm
fr_fr: vous devez choisir une valeur pour limit1hm

source: you need to choose a value for limit2hm
fr_fr: vous devez choisir une valeur pour limit2hm

source: limit1hm should be numeric or integer
fr_fr: limit1hm doit être un nombre ou un entier

source: limit2hm should be numeric or integer
fr_fr: limit2hm doit être un nombre ou un entier

source: you are in deep shit
fr_fr: vous êtes grave dans la merde

source: internal error
fr_fr: erreur interne

source: plot.type must be 1,2
fr_fr: plot.type doit être 1 ou 2

source: The graphical object is written is env_stacomi, type p<-get('p',envir=envir_stacomi)
fr_fr: L'objet graphique est décrit dans envir_stacomi, écrire g<-get('g',envir=envir_stacomi)

source: the r_seaa should be of class report_sea_age
fr_fr: le r_seaa devrait avoir pour class report_sea_age

source: Age calculated from the size of fish compared to reference value %s for the limit between 1 sea winter and 2 sea winter fish, and %s for the limit between 2 sea winter fish and 3 sea winter fish
fr_fr: Age calculé à partir de la taille des poissons comparée à une valeur de référence %s pour la limite entre des poissons de un hiver de mer et de deux hiver, et %s pour la limite entre deux hiver de mer et trois hiver de mer

source: Writing %s age values in the database
fr_fr: Ecriture de %s valeur d'âge dans la base de données

source: No data to remove
fr_fr: Aucun donnée à enlever

source: No data of silver or yellow eel on the selected period
fr_fr: Pas de données d'argentées ou d'anguilles jaunes sur la période demandée

source: size (BL mm)
fr_fr: taille (LT mm)

source: Mean eye diameter (MD mm)
fr_fr: Diamètre occulaire moyen (DM mm)

source: Silvering stages (Durif et al. 2009)
fr_fr: Stades pigmentaires (Durif et al. 2009)

source: Number by silvering stage
fr_fr: Effectif par stade d'Argenture

source: Size (mm)
fr_fr: Taille (mm)

source: Weight(g)
fr_fr: Poids(g)

source: Size (BL mm)
fr_fr: Taille (LT mm)

source: Query failed for the view vue_ope_lot_car
fr_fr: Echec de la requête vers la vue vue_ope_lot_car

source: data loaded from the database for report_species
fr_fr: données chargées depuis la base de données pour report_species

source: No data named bilesp in envir_stacomi
fr_fr: Pas de données nommées bilesp dans envir_stacomi

source: Checking objects and launching query
fr_fr: Verifications des objets et lancement de la requete

source: A report_species object was stored into envir_stacomi environment : write bilesp=get('bilesp',envir_stacomi)
fr_fr: L'objet Bilan est stocke dans l'environnement envir_stacomi, écrire bilesp=get('bilesp',envir_stacomi)

source: No fish in the database for this period
fr_fr: Il n'y a aucun poisson dans la base sur cette periode

source: Some negative counts are transformed into positive ones
fr_fr: Attention certains effectifs négatifs sont transformés en positifs

source: No data in the calcdata slot, did you forget to run calculations ?
fr_fr: Pas de donnée dans le slot calcdata, avez-vous oublié de lancer la méthode calcule

source: Taxa-stage
fr_fr: Taxon-stade

source: The vector of color should be of length %s
fr_fr: Le vecteur de couleur (color) doit avoir une longueur %s

source: plot.type should be one of barplot or pie
fr_fr: plot.type devrait être un parmi barplot ou pie

source: the object g has been assigned to envir_stacomi
fr_fr: l'object ggplot p est enregistré dans envir_stacomi

source: attention, negative numbers were transformed into positive numbers
fr_fr: Attention les effectifs négatifs sont transformés en positifs

source: Calculation of the operating fishway
fr_fr: Calculs du fonctionnement du dispositif de franchissement

source: Calculation of the operating counting device
fr_fr: Calculs du fonctionnement du dispositif de comptage

source: Summary of the operations of a device ... to do
fr_fr: Bilan des operations d'un dispositif ...a developper

source: Summary between the operating fishway and the counting device ... to do
fr_fr: Bilan croisé entre le fonctionnement de la passe et du DC... a faire

source: Migration summary (for a species and a stage)
fr_fr: Bilan migration (par espèce et stade)

source: For help, contact Cedric Briand - 0033 29 99 08 844 - cedric.briand@eptb-vilaine.fr, or mail stacomi@googlegroups.com.
fr_fr: Pour de l'aide, contacter Cédric Briand - 02 99 90 88 44 - cedric.briand@eptb-vilaine.fr or stacomi@googlegroups.com

source: Summary of interannual migration
fr_fr: Bilan migration interannuelle

source: Summary of migration environnemental conditions
fr_fr: Bilan migration et conditions environnementales

source: Summary of migration with parameters
fr_fr: Bilan migration avec paramètres

source: Summary of the environnemental conditions
fr_fr: Bilan des conditions environnementales

source: Summary of samples characteristics (size, weight...) by calling the view vue_lot_ope
fr_fr: Résumé des caractéristiques des échantillons (taille, poids...) par appel à la vue vue_lot_ope

source: Lengths summary, not implemented
fr_fr: Bilan des tailles, pas développé

source: Summary of average weight for the calculation of the relation between length and number.
fr_fr: Bilan des poids moyens en vue du calcul des relations poids effectif.

source: Not adapted yet to version 0.5.2
fr_fr: Pas encore adapté pour la version 0.5.2

source: Species summary of the counting device
fr_fr: Bilan espèces pour le dispositif de comptage

source: Age calculation from size limit
fr_fr: Calcul de l'âge à partir de la limite de taille

source: Error when using the method connect of the ConnectionODBC class
fr_fr: Erreur dans l'utilisation de la methode connect de la classe ConnexionODBC

source: Problem during the test, the ODBC link works but doesn't point to the database 0.5, check the ODBC link
fr_fr: Problème lors du test, le lien ODBC fonctionne mais ne pointe pas vers la base version 0.5, vérifiez le lien ODBC

source: ODBC link
fr_fr: lien ODBC

source: User
fr_fr: Utilisateur

source: Password
fr_fr: Mot de passe

source: Error title of the frame
fr_fr: Erreur du titre du cadre

source: Problem when testing the ODBC connection
fr_fr: Problème lors du test de la connexion ODBC

source: Connection
fr_fr: Connextion

source: Migratory treatment
fr_fr: Traitement migration

source: Counting Device
fr_fr: Dispositif de Comptage

source: Operation (TODO)
fr_fr: Opération (TODO)

source: Fishway without counting device (TODO)
fr_fr: DF sans DC (TODO)

source: Multiple migrations
fr_fr: Migrations multiples

source: Yearly
fr_fr: Annuel

source: Inter annual migration
fr_fr: Migration interannuelle

source: Sample characteristics
fr_fr: Caractéristiques du lot

source: Environnemental conditions
fr_fr: Conditions environnementales

source: Migration. ~Environnemental conditions
fr_fr: Migr.~Cond. Env.

source: Migration / quant. param. / qual. param.
fr_fr: Migr./ parm. quant / parm. qual.

source: Species
fr_fr: Espèces

source: Average weight glass eel
fr_fr: Poids Moyen civelle

source: Lenghts
fr_fr: Tailles

source: Pigmentary stages
fr_fr: Stades pigmentaires

source: Silver eel
fr_fr: Anguilles argentées

source: Treatment size - age salmonids
fr_fr: Analyse taille - âge des salmonidés

source: Output of the program
fr_fr: Sorties du programme

source: horodatedebut not in column names for data
fr_fr: horodatedebut n'apparaît pas dans les noms de colonnes dans les données

source: horodatefin not column names for data
fr_fr: horodatefin n'apparaît pas dans les noms de colonnes dans les données

source: The color argument should have length %s
fr_fr: l'argument couleur doit avoir une longueur %s

source: The following name(s) %s do not match vector name: %s
fr_fr: Les noms suivants %s ne correspondent pas à ceux du vecteur %s

source: %d operation
fr_fr: opération
